{   
    "lang": "de",
    "home": "Start",
    "projects": "Projekte",
    "about": "Über mich",
    "contact": "Kontakt",
    "welcome": "Servus",
    "starttext": "Ich bin Justus, ein begeisterter Full-Stack-Entwickler mit einer Leidenschaft dafür, kreative Ideen in intuitive und interaktive Anwendungen umzusetzen. Schau dir meine Projekte an und erlebe, wie ich Technik und Kreativität verbinde. Lass uns gemeinsam etwas Besonderes erschaffen!",
    "getstarted": "Los geht's",
    "scrolldown": "Scrolle nach unten um loszulegen",
    "frontend": "Als Front-End-Entwickler liegt mein Fokus darauf, responsive und benutzerfreundliche Interfaces mit React, Next.js und Tailwind CSS zu erstellen. Mein Ziel ist es, intuitive und optisch ansprechende Webanwendungen zu entwickeln, die auf allen Geräten eine reibungslose Benutzererfahrung bieten.",
    "backend": "Ich entwickle leistungsstarke und skalierbare Backend-Systeme mit Technologien wie Node.js, Express, Django und Datenbanken wie MongoDB und MySQL. Durch den Einsatz von Redis optimiere ich die Performance und stelle sicher, dass die Anwendungen zuverlässig und effizient laufen.",
    "wn": "Und nun?",
    "coll": "Schauen Sie sich gerne meine Projekte an um mehr zu erfahren oder melden Sie sich, wenn Sie an einer Zusammenarbeit interessiert sind!",
    "subject": "Betreff",
    "mess": "Nachricht",
    "send": "Senden",
    "iag": "Ich stimme der Datenverarbeitung zu.",
    "pp": "Datenschutzerklärung",
    "imprint": "Impressum",
    "owner": "Eigentümer",
    "address": "Adresse",
    "phone": "Telefon",

    "project1_headline": "Kundenmanagement-System",
    "project1_text": "Als ich begann, Django zu lernen, wollte ich ein Kundenmanagement-System für meine fiktive Webdesign-Agentur nofrog bauen. Dieses Backend-orientierte Projekt umfasst Funktionen wie Authentifizierung, Echtzeit-Chat, projektbezogene Pinnwände und Dokumentenspeicherung. Es verwendet einfaches CSS für das Styling und hat keine mobile Version. Der Übergang von MongoDB zu relationalen Datenbanken und die Implementierung von WebSockets waren spannende Herausforderungen.",
    "project2_headline": "NoFrog Webdesign Homepage",
    "project2_text": "Dies ist die Homepage für meine fiktive Webentwicklungsagentur 'nofrog', die sanfte Animationen, ein Kontaktformular und ein System zur Verfolgung von Anfragenstatus enthält. Durch dieses Projekt habe ich die Grundlagen von Node.js/Express und die Integration von MongoDB gelernt. Die App wurde mit React entwickelt, nutzt React Router und bietet ein vollständig responsives Design, das für mobile Geräte optimiert ist.",
    "project3_headline": "Rocket Game",
    "project3_text": "Diese App enthält ein einfaches und unterhaltsames Raketen-Spiel, das in Vanilla JavaScript programmiert wurde. Die Spieler steuern die Rakete mit den WASD-Tasten, um Hindernisse zu überwinden und so viele Münzen wie möglich zu sammeln. Mehrere Levels erhöhen die Schwierigkeit des Spiels, während man voranschreitet. Die Entwicklung des Raketen-Spiels half mir, Node.js/Express zu üben und führte mich während der Bereitstellung an Redis heran. Probier es aus – es macht wirklich Spaß!",
    "project4_headline": "Portfolio",
    "project4_text": "Ich habe meine Portfolio-Seite so gestaltet, dass sie ein ansprechendes Layout mit einer SEO-freundlichen Herangehensweise kombiniert, weshalb ich mich für Next.js, ein Framework auf Basis von React, entschieden habe. Das Erlernen verschiedener Rendering-Techniken und die Implementierung eines benutzerdefinierten Authentifizierungssystems von Grund auf war herausfordernd, aber lohnend. Dieses Projekt hat meine React-Kenntnisse erheblich verbessert und mein Verständnis für grundlegende Authentifizierungskonzepte sowie Cookie-Verwaltung vertieft.",
    "ht":"Hallo! Ich freue mich, meine Projekte mit Ihnen zu teilen!",
    "am": "Über mich",
    "introduction": "Hallo! Ich bin ein 17-jähriger angehender Softwareingenieur und Fullstack-Webentwickler aus München. Ich bin leidenschaftlich daran interessiert, innovative und skalierbare Lösungen für reale Herausforderungen zu schaffen. Ich freue mich, neue Technologien zu lernen und meine Skills zu verbessern, um komplexe Probleme zu lösen und anspruchsvolle Apps zu bauen.",
    "location": "📍 München, Deutschland",
    "profession": "💼 Fullstack",
    "mj": "Meine Geschichte:",
    "jan24": "Januar 2024",
    "jan24t": "Ich begann, die Grundlagen der Programmierung mit Python zu erlernen",
    "mar24": "März 2024",
    "mar24t": "Ich tauchte in die Frontend-Webentwicklung ein und konzentrierte mich auf HTML und CSS",
    "apr24": "April 2024",
    "apr24t": "Ich begann, JavaScript zu erforschen, um ansprechende, interaktive Designs zu erstellen",
    "jun24": "Juni 2024",
    "jun24t": "Ich setzte meine Fortschritte in der Frontend-Webentwicklung fort, indem ich React als robustes Framework wählte. Zusätzlich suchte ich nach effizienteren Möglichkeiten, Webseiten zu stylen",
    "aug24": "August 2024",
    "aug24t": "Webseiten zu gestalten fühlte sich schon gut an, aber ich wollte einen minimalistischen Ansatz für den Bau voll funktionsfähiger Web-Apps. Node.js und Express lernen. MongoDB, schien die richtige Wahl zu sein, obwohl ich es herausfordernder empfand, als mit Django zu beginnen",
    "oct24": "Oktober 2024",
    "oct24t": "Ich erkannte, dass die Verwaltung komplexer Web-Apps mit Node.js und Express schnell kompliziert wird. Um es zu vereinfachen, begann ich, mich mit Django zu beschäftigen, mit dem Ziel, ein Kundenmanagementsystem für eine fiktive Webentwicklungsagentur zu bauen",
    "dec24": "Dezember 2024",
    "dec24t": "Als das Jahr zu Ende ging bemerkte ich, dass ich an meinen IT-Sicherheitsfähigkeiten arbeiten sollte. Ich informierte mich über verschiedene Hacking-Techniken kennen, darunter SQL-Injektionen, XSS und CSRF-Angriffe",
    "jan25": "Januar 2025",
    "jan25t": "Um einen SEO-freundlicheren Ansatz mit React zu verfolgen, begann ich, Next.js zu lernen. Ich erforschte auch Redis, während ich z. B. die Sitzungs-Authentifizierung für meine Anwendungen implementierte. Zudem beschäftigte ich mich mit Docker um meine Projekte zu deployen",
    "specialization": "Ich spezialisiere mich sowohl auf Front-End- als auch Back-End-Entwicklung und arbeite mit Technologien wie HTML, CSS, Tailwind CSS, JavaScript, React und Next.js, um nahtlose Benutzererlebnisse zu schaffen. Im Backend nutze ich MongoDB, Node.js, Django, MySQL und Redis, um sichere und effiziente Systeme zu erstellen.",
    "personalProjects": "Obwohl ich noch am Anfang meiner Reise stehe, habe ich mir vorgenommen, eine solide Grundlage zu schaffen, indem ich reale Herausforderungen in meinen persönliche Projekte berücksichtige. Sie können einige der Dinge, an denen ich gearbeitet habe,",
    "ppp": "hier",
    "explore": " erkunden",
    "goal": "Mein Ziel ist es, als Entwickler zu wachsen, moderne Technologien zu lernen und zu bedeutungsvollen Projekten beizutragen. Wenn Sie nach jemandem suchen, der motiviert, neugierig und bereit ist, neue Herausforderungen anzunehmen, würde ich mich freuen, mich mit Ihnen zu verbinden!",
    "ccc": "Ich würde mich freuen, von Ihnen zu hören! Ob Sie eine Frage haben, Feedback geben oder ein Projekt besprechen möchten, melde Sie sich gerne. Nutzen Sie einfach das Formular unten oder senden Sie mir direkt eine E-Mail, und ich werde so schnell wie möglich antworten.",
    "privacyTitle": "Datenschutzrichtlinie",
  "generalInfoTitle": "1. Allgemeine Informationen",
  "generalInfoText": "Wir nehmen den Schutz Ihrer Daten sehr ernst und behandeln Ihre persönlichen Daten vertraulich und gemäß den gesetzlichen Bestimmungen.",
  
  "cookiesTitle": "2. Verwendung von Cookies",
  "cookiesText": "Wir verwenden Cookies ausschließlich zu Authentifizierungszwecken. Das bedeutet, dass wir nur dann Cookies setzen, wenn Sie sich auf unserer Website anmelden oder eine Sitzung starten. Diese Cookies sind notwendig, damit Sie die Website nutzen können und wir Sie während Ihres Besuchs identifizieren können.",
  "cookiesType": "Art der Cookies: Sitzungs-Cookies",
  "cookiesPurpose": "Zweck: Authentifizierung und Sitzungsmanagement",
  "cookiesDuration": "Speicherdauer: Bis zum Ende Ihrer Sitzung oder maximal 1 Stunde",
  
  "contactFormTitle": "3. Kontaktformular",
  "contactFormText": "Wenn Sie das Kontaktformular auf unserer Website verwenden, um uns eine Nachricht zu senden, werden die dort eingegebenen Daten (z. B. Name, E-Mail-Adresse, Betreff und Nachricht) nur verwendet, um Ihre Anfrage zu bearbeiten.",
  "contactFormDataUse": "Die Daten werden ohne Ihre ausdrückliche Zustimmung niemals an Dritte weitergegeben. Nach dem Absenden des Formulars wird Ihre Anfrage per E-Mail an uns gesendet (und möglicherweise an die von Ihnen angegebene E-Mail-Adresse). Wir speichern diese Daten nur so lange, wie es zur Bearbeitung Ihrer Anfrage erforderlich ist.",
  
  "dataDisclosureTitle": "4. Datenweitergabe",
  "dataDisclosureText": "Wir geben Ihre Daten nicht an Dritte weiter, es sei denn, es ist zur Bearbeitung Ihrer Anfrage erforderlich oder es besteht eine gesetzliche Verpflichtung dazu. In keinem Fall verkaufen wir Ihre persönlichen Daten.",
  
  "rightsTitle": "5. Ihre Rechte",
  "rightsText": "Sie haben jederzeit das Recht, Auskunft über die bei uns gespeicherten personenbezogenen Daten zu erhalten und die Berichtigung, Löschung oder Einschränkung der Verarbeitung Ihrer Daten zu verlangen.",
  
  "policyChangesTitle": "6. Änderungen der Datenschutzrichtlinie",
  "policyChangesText": "Wir behalten uns vor, diese Datenschutzrichtlinie bei Bedarf anzupassen, um sie an neue gesetzliche Anforderungen oder technische Entwicklungen anzupassen. Die neueste Version kann immer auf dieser Seite eingesehen werden.",
  
  "contactTitle": "7. Kontakt",
  "contactText": "Wenn Sie Fragen zur Datenschutzrichtlinie oder zu Ihren persönlichen Daten haben, können Sie uns unter folgender E-Mail-Adresse kontaktieren:",
  "email": "justus.webdev@gmail.com",
  "cmsTitle": "Customer Management System",
  "cmsDescription": "Das nofrog Customer Management System wurde entwickelt, um meiner fiktiven Webentwicklungsagentur zu helfen, Kundeninteraktionen und Projekte zu verwalten. Die App umfasst Funktionen für das Projektmanagement, Echtzeit-Chat und mehr. Sie ermöglicht es auch, Ankündigungen an Kunden zu machen und Dokumente online zu speichern, die mit allen Projektmitgliedern geteilt werden können. Dieses System optimiert die Kommunikation und Zusammenarbeit und erleichtert die Verwaltung und Verfolgung des Projektfortschritts.",
  
  "cmsLearning": "Die Entwicklung der App hat mir viel über relationale Datenbanken und das Django-Framework beigebracht. Der Aufbau der Chat-Funktion hat auch meine WebSocket-Fähigkeiten verbessert. Da ich Programmiergrundlagen in Python gelernt habe, hat mir die Arbeit mit Django besonders gut gefallen, vor allem wegen seiner einfachen Authentifizierungstechnik. Obwohl der Hauptfokus der Website auf der Backend-Architektur liegt, enthält die App nur grundlegendes CSS-Design. Die Erfahrung hat mir geholfen, mein Verständnis für Backend-Entwicklung und Echtzeit-Kommunikation zu vertiefen. Dennoch war dies mein erstes Fullstack Projekt, welches mir erst Schritt-für-Schritt alle notwendigen Techniken und Konzepte beigebracht hat - und sicher nicht perfekt.😉",
  
  "cmsYourTurnTitle": "Jetzt bist du dran!",
  "cmsTryApp": "Probieren Sie die App mit den folgenden Login-Daten aus:",
  "cmsUsername": "Benutzername",
  "cmsPassword": "Passwort",
  
  "exploreApp": "App erkunden!",
  "nofrogTitle": "NoFrog Homepage",
  "nofrogDescription": "Als ich mit React angefangen habe, setzte ich mir als Ziel, eine elegante Landing-Page mit Animationen zu erstellen, um die Benutzererfahrung zu verbessern. Um diese Idee umzusetzen, habe ich eine Landing-Page für meine fiktive Webentwicklungsagentur, nofrog, entwickelt. Die App umfasst spannende Animationen, ein Kontaktformular und eine Funktion zur Verfolgung des Status von Benutzeranfragen. Dieses Projekt half mir, mein Verständnis für Front-End-Designprinzipien und die Möglichkeiten von React für interaktive Oberflächen zu verbessern.",
  
  "nofrogLearning": "Die Entwicklung der App hat mir viel über React und seine Kernkonzepte beigebracht, sowie über Node/Express-Backend-Architektur und die MongoDB-Datenbank. Es war mein erster Ausflug in die Backend-Entwicklung und erwies sich als ziemlich herausfordernd, da der Aufbau von Backends mit Express schwieriger war, als ich erwartet hatte – und komplexer im Vergleich zu Django. Diese Erfahrung hat jedoch mein Verständnis für Full-Stack-Entwicklung und das Zusammenspiel zwischen Frontend und Backend-Systemen erheblich erweitert.",
  
  "nofrogTechTitle": "Verwendete Technologien:",
  "rg": "Rocket Game",
  "startHighscore": "Können Sie ",
  "midH": " Highscore von ",
  "endH": " übertreffen?",
  "rgdesc": "Das Rocket Game ist ein spannendes und temporeiches Browserspiel, bei dem du eine Rakete mit den WASD-Tasten steuerst. Deine Aufgabe ist es, Hindernissen geschickt auszuweichen und Münzen einzusammeln. Mit jedem neuen Level steigen die Herausforderungen, sodass das Spiel mit der Zeit immer anspruchsvoller wird. Ziel ist es, möglichst viele Münzen zu sammeln und dabei Zusammenstöße zu vermeiden, um eine Bestleistung zu erzielen. Das Spiel vereint einfache Steuerung mit einem mitreißenden Gameplay und ist ideal, um Reaktionsgeschwindigkeit und Geschicklichkeit in einer unterhaltsamen Umgebung zu testen.",
  "rgdesc2": "Im Rocket Game-Projekt habe ich die Spielmechanik und Interaktionen mit reinem JavaScript entwickelt, um eine schlanke und effiziente Umsetzung zu gewährleisten. Die Struktur des Spiels basiert auf HTML5, während CSS für das Styling und ein responsives Design sorgt, das sich an verschiedene Geräte anpasst. Im Backend kam Node.js zusammen mit Express zum Einsatz, um einen stabilen Server für die Spielverwaltung bereitzustellen. Für das Sitzungsmanagement wurde Redis integriert, wodurch Highscores und Spieldaten über mehrere Sitzungen hinweg nahtlos gespeichert und abgerufen werden können. Diese Kombination aus Technologien ermöglicht ein flüssiges, interaktives Spielerlebnis und bietet gleichzeitig eine zuverlässige und skalierbare Backend-Infrastruktur.",
  "note": "Info: Das Laden der Seite kann ein wenig dauern",
  "mpp": "Mein Portfolio",
  "portdesc": "Den Aufbau meiner Portfolio-Seite mit Next.js und Tailwind CSS war eine spannende Herausforderung, die meine Fähigkeiten auf ein neues Level gebracht hat. Das Projekt half mir, mein Verständnis für das React-Ökosystem zu vertiefen und gleichzeitig die Funktionen von Next.js wie serverseitiges Rendering und dynamisches Routing zu erkunden. Dank Tailwind CSS konnte ich ein sauberes, responsives Design effizient umsetzen, sodass die Seite auf allen Geräten ansprechend aussieht. Außerdem hatte ich die Möglichkeit, ein individuelles Authentifizierungssystem zu implementieren, das für zusätzliche Sicherheit sorgt. Dabei habe ich viel über den Umgang mit Cookies und den Schutz sensibler Daten gelernt. Insgesamt zeigt dieses Projekt nicht nur meine technischen Fähigkeiten, sondern auch meine Kompetenz, eine benutzerfreundliche und SEO-optimierte Webanwendung zu entwerfen.",
  "techs": "Technologien:",
  "aatitle": "Academy App",
  "aa_headline": "Academy App",
  "aa_text":" Die Academy App ist eine Webanwendung um Lerninhalte zu Themen rund um die Informatik zu verkaufen. Ich habe die Plattform vollständig selbst aufgebaut, beginnend bei einer User Login über Nextjs und Redis sowie einer selbstentwickelten Django API. Natürlich gibt es auch für Admin einen separaten Bereich, der es Ihnen erlaubt die Inhalte zu verwlaten. Durch die App konnte ich mein Backend Wissen wiederholt erheblich verbessern, auch Stripe konnte ich so super kennenlernen. Die App verfügt zudem natürlich auch über ein responsives Design.",
  "aaDescription": "Die Academy ist eine Plattform, die Nutzern ermöglicht, Lerninhalte im Bereich Informatik zu entdecken und sich gezielt weiterzubilden, während eine intuitive Benutzeroberfläche für ein angenehmes Nutzungserlebnis sorgt. Durch die Integration eines Stripe-Abo-Modells werden Zahlungen automatisiert und sicher abgewickelt, sodass sich die Nutzer vollständig auf ihre Kurse konzentrieren können. Neben der Speicherung erworbener Inhalte im persönlichen Kundenkonto bietet die Plattform verschiedene Bearbeitungsfunktionen, mit denen sich Kurse flexibel verwalten und anpassen lassen. Ein geschützter Login-Bereich sorgt für die Sicherheit aller Nutzerdaten und stellt sicher, dass nur berechtigte Personen Zugriff auf ihre Inhalte haben. Zusätzlich gibt es ein Admin-Dashboard für Produktadministratoren, die neue Kurse verwalten, bestehende Angebote aktualisieren und die Plattform weiterentwickeln können.",
  "aaLearning": "Die Entwicklung der App war eine wertvolle Erfahrung, die mir tiefere Einblicke in moderne Webtechnologien und skalierbare Architekturen ermöglicht hat. Besonders die Integration von Stripe hat mir gezeigt, wie Zahlungssysteme nahtlos in eine Anwendung eingebunden werden können, während ich gleichzeitig mein Verständnis für Redis als leistungsstarken In-Memory-Datenspeicher weiter ausbauen konnte.  Ein zentraler Bestandteil des Projekts war das Design skalierbarer Systeme, bei dem ich mit Docker gearbeitet habe, um containerisierte Anwendungen effizient bereitzustellen. Zusätzlich habe ich mich intensiv mit Cloudflare R2 und AWS S3 Storage auseinandergesetzt, um eine performante und zuverlässige Speicherung großer Datenmengen sicherzustellen.  Ein weiteres Highlight war die Entwicklung einer eigenen API, die präzise Anfragen verarbeitet und eine sichere Kommunikation zwischen Frontend und Backend ermöglicht. Dabei konnte ich meine Kenntnisse in Next.js weiter vertiefen und habe ein vollständig eigenes Authentifizierungssystem im Backend implementiert, das speziell auf die Anforderungen der App zugeschnitten ist. Auch im Bereich Backend-Entwicklung mit Django habe ich wertvolle Erfahrungen gesammelt, insbesondere bei der Anbindung einer API an eine PostgreSQL-Datenbank für eine effiziente und skalierbare Datenverwaltung. Ergänzt wurde das technologische Fundament durch Tailwind CSS, das es mir ermöglicht hat, eine moderne und flexible Benutzeroberfläche mit minimalem Overhead zu gestalten. Dieses Projekt war nicht nur eine technische Herausforderung, sondern auch eine Gelegenheit, mein Wissen über hochmoderne Webtechnologien zu erweitern und gleichzeitig ein System zu entwickeln, das Leistung, Skalierbarkeit und Sicherheit vereint.",
  "aaYourTurnTitle":"Probieren Sie die App gerne aus - mit folgenden Beispielzahldaten:",
  "aaCardNumber": "Kartennummer: 4242 4242 4242 4242"  ,
  "aaInfo": "Gültig bis: 12/34 , CVC: 123"
}